# IsClassChoiceSelected

## Description
Returns if 'By Class' is the selected choice in a marker, line style, or color popup control.

```pascal
FUNCTION IsClassChoiceSelected(
				dialogID    : LONGINT;
				componentID : LONGINT) : BOOLEAN;
```

```python

def vs.IsClassChoiceSelected(dialogID, componentID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|Id of the dialog|
|componentID|LONGINT|Id of the popup control|

## Version
Availability: from Vectorworks 2012
## Category
* Dialogs - Modern